Diverging_Converging_Duct/3Dduct/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 4e-5;

boundaryField
{
    wall
    {
      //        type            nutkWallFunction;
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 4e-5;
    }
     outlet
    {
      type            zeroGradient;
    }

     centerline
    {
        type            symmetryPlane;
    }

    back
      {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
